public class hello{
    // static int a = 60;
    // static int c = 0;
    public static void main(String[] args) {
        System.out.println("hello world");
        // c = a >>> 4;
        // System.out.println("a >>> 4 = " + c);

    }
}
//摸鱼

/*摸鱼啊摸鱼 */

/*摸鱼啊摸鱼 */

//类----具有共同性质的一组事物的自定义的复合数据类型
/*
 * 类----基本属性，基本功能
 * 基本属性---变量，用来在类中描述基本属性
 * 基本功能---方法，用来做什么事
 */

 /*
  * 基本数据类型  boolean---表示一位的信息，只有true跟false，默认false
  常量---用final来修饰，后跟着数据类型的声明，通常用大写字母来表示常量
  自动类型转换----整型、实型（常量）、字符型数据可以混合运算。运算中，不同类型的数据先转化为同一类型，然后进行运算。转换从低级到高级。
  */

  //变量的类型
  /*
   * 类变量：独立于方法之外的变量，用 static 修饰。
    实例变量：独立于方法之外的变量，不过没有 static 修饰。
    局部变量：类的方法中的变量。局部变量没有默认值，必须初始化
    实例变量：具有默认值，默认0，布尔型变量的默认为false。一般情况下应该把实例变量设为私有。通过使用访问修饰符可以使实例变量对子类可见；
   */